In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
string_data = pd.Series(['dark', 'bag', np.nan, 'avocado'])

In [5]:
string_data

0       dark
1        bag
2        NaN
3    avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0]=None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.0], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.0]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4]=NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))

In [22]:
df.iloc[:4, 1]=NA

In [23]:
df.iloc[:2, 2]=NA

In [24]:
df

          0         1         2
0  2.320065       NaN       NaN
1  1.872086       NaN       NaN
2  1.720473       NaN  0.181323
3  0.367958       NaN  0.294489
4  0.874101 -0.557742  0.236549
5  1.596381 -0.352013 -1.310827
6 -1.691850  1.831869  1.098611

In [25]:
df.dropna()

          0         1         2
4  0.874101 -0.557742  0.236549
5  1.596381 -0.352013 -1.310827
6 -1.691850  1.831869  1.098611

In [26]:
df.dropna(thresh=2)

          0         1         2
2  1.720473       NaN  0.181323
3  0.367958       NaN  0.294489
4  0.874101 -0.557742  0.236549
5  1.596381 -0.352013 -1.310827
6 -1.691850  1.831869  1.098611

In [27]:
df.fillna(0)

          0         1         2
0  2.320065  0.000000  0.000000
1  1.872086  0.000000  0.000000
2  1.720473  0.000000  0.181323
3  0.367958  0.000000  0.294489
4  0.874101 -0.557742  0.236549
5  1.596381 -0.352013 -1.310827
6 -1.691850  1.831869  1.098611

In [28]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  2.320065  0.500000  0.000000
1  1.872086  0.500000  0.000000
2  1.720473  0.500000  0.181323
3  0.367958  0.500000  0.294489
4  0.874101 -0.557742  0.236549
5  1.596381 -0.352013 -1.310827
6 -1.691850  1.831869  1.098611

In [30]:
exist = df.fillna(0, inplace=True)

In [31]:
df

          0         1         2
0  2.320065  0.000000  0.000000
1  1.872086  0.000000  0.000000
2  1.720473  0.000000  0.181323
3  0.367958  0.000000  0.294489
4  0.874101 -0.557742  0.236549
5  1.596381 -0.352013 -1.310827
6 -1.691850  1.831869  1.098611

In [32]:
exist

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))

In [34]:
df.iloc[2:, 1] = NA

In [36]:
df.iloc[4:, 2] = NA

In [37]:
df

          0         1         2
0 -0.513896 -0.147503 -2.339504
1  2.001595  0.185853  1.525432
2  1.122349       NaN  0.714970
3 -0.427097       NaN -0.137302
4  0.012802       NaN       NaN
5 -0.632865       NaN       NaN

In [38]:
df.fillna(method='ffill')

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13340\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0 -0.513896 -0.147503 -2.339504
1  2.001595  0.185853  1.525432
2  1.122349  0.185853  0.714970
3 -0.427097  0.185853 -0.137302
4  0.012802  0.185853 -0.137302
5 -0.632865  0.185853 -0.137302

In [39]:
df.fillna(method='ffill', limit=2)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13340\2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.513896 -0.147503 -2.339504
1  2.001595  0.185853  1.525432
2  1.122349  0.185853  0.714970
3 -0.427097  0.185853 -0.137302
4  0.012802       NaN -0.137302
5 -0.632865       NaN -0.137302

In [40]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [42]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [43]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [44]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
data['k3'] = range(7)

In [49]:
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [50]:
data.drop_duplicates(['k1'])

    k1  k2  k3
0  one   1   0
1  two   1   1

In [52]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [53]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [54]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [55]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [56]:
lowercased = data['food'].str.lower()

In [57]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [58]:
data['animal'] = lowercased.map(meat_to_animal)

In [59]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [60]:
data = pd.Series([1.0, -999.0, 2.0, -999.0, -1000.0, 3.0])

In [61]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [62]:
data.replace(-999.0, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace([-999.0,-1000.0], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [64]:
data.replace([-999.0,-1000.0], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [65]:
data.replace({-999.0: np.nan, -1000.0: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [66]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [67]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [68]:
transform = lambda x: x[:4].upper()

In [71]:
data.index = data.index.map(transform)

In [72]:
data.index

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [73]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [74]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [75]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [76]:
data.rename(index=str.title, columns=str.upper, inplace=True)

In [77]:
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [78]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [79]:
bins = [18, 25, 35, 60, 100]

In [80]:
ages_sep = pd.cut(ages, bins)

In [81]:
ages_sep

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [82]:
ages_sep.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [83]:
ages_sep.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [84]:
pd.value_counts(ages_sep)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13340\3539254579.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(ages_sep)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [85]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [87]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [88]:
pd.cut(np.random.rand(20), 5, precision=2)

[(0.028, 0.22], (0.41, 0.59], (0.59, 0.78], (0.22, 0.41], (0.78, 0.97], ..., (0.028, 0.22], (0.028, 0.22], (0.59, 0.78], (0.22, 0.41], (0.028, 0.22]]
Length: 20
Categories (5, interval[float64, right]): [(0.028, 0.22] < (0.22, 0.41] < (0.41, 0.59] < (0.59, 0.78] < (0.78, 0.97]]

In [89]:
data = np.random.randn(1000)

In [90]:
cats = pd.qcut(data, 4)

In [91]:
cats

[(-2.6919999999999997, -0.658], (-2.6919999999999997, -0.658], (0.669, 2.964], (-0.0254, 0.669], (0.669, 2.964], ..., (-2.6919999999999997, -0.658], (-0.658, -0.0254], (-0.658, -0.0254], (-0.658, -0.0254], (-0.0254, 0.669]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.6919999999999997, -0.658] < (-0.658, -0.0254] < (-0.0254, 0.669] < (0.669, 2.964]]

In [93]:
pd.value_counts(cats)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13340\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(-2.6919999999999997, -0.658]    250
(-0.658, -0.0254]                250
(-0.0254, 0.669]                 250
(0.669, 2.964]                   250
Name: count, dtype: int64

In [94]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [95]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052137    -0.013054     0.005259     0.004927
std       0.955441     0.964109     0.997248     0.992760
min      -2.992642    -2.853039    -2.589944    -2.774237
25%      -0.678198    -0.676867    -0.686111    -0.670506
50%      -0.064059    -0.057915     0.016521     0.011500
75%       0.577817     0.638181     0.677611     0.666029
max       2.840975     2.915850     3.777223     3.268167

In [98]:
col= data[2]

In [99]:
col[np.abs(col) > 3]

117    3.777223
460    3.260628
Name: 2, dtype: float64

In [101]:
data[(np.abs(data) > 3).any(axis=1)]

            0         1         2         3
117 -0.536053  2.504418  3.777223  1.131548
409 -0.414516 -0.409636 -0.469686  3.051089
460 -1.466269  0.637668  3.260628  1.379878
689  0.245873  1.914911 -0.748984  3.147094
869 -1.253831  1.757476 -0.349272  3.038848
890  0.357517  0.797384 -0.272953  3.268167
944 -1.656165  1.027735 -1.268142  3.027987

In [102]:
data[np.abs(data) > 3] = np.sign(data)*3

In [105]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052137    -0.013054     0.004222     0.004394
std       0.955441     0.964109     0.993785     0.991098
min      -2.992642    -2.853039    -2.589944    -2.774237
25%      -0.678198    -0.676867    -0.686111    -0.670506
50%      -0.064059    -0.057915     0.016521     0.011500
75%       0.577817     0.638181     0.677611     0.666029
max       2.840975     2.915850     3.000000     3.000000

In [106]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [107]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [108]:
sample = np.random.permutation(5)

In [109]:
sample

array([1, 0, 4, 3, 2], dtype=int32)

In [110]:
df.take(sample)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [111]:
df.sample(n=2)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [112]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [113]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [114]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [115]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [116]:
dummies

   key_a  key_b  key_c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [117]:
df_with_dummy = df[['data1']].join(dummies)

In [118]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [119]:
mnames = ['movie_id', 'title', 'genres']

In [125]:
movies = pd.read_table("C:/Users/lenovo/Downloads/movies.dat", sep='::', header=None, names=mnames)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13340\2605217153.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table("C:/Users/lenovo/Downloads/movies.dat", sep='::', header=None, names=mnames)

In [126]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [127]:
all_genres = []

In [128]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [129]:
genres = pd.unique(all_genres)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13340\1657210076.py:1: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  genres = pd.unique(all_genres)

In [130]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [131]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [132]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [133]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [134]:
gen = movies.genres[0]

In [136]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [137]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [138]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [139]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [140]:
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [141]:
val = 'a,b,  guido'

In [142]:
val.split(',')

['a', 'b', '  guido']

In [143]:
pieces = [x.strip() for x in val.split(',')]

In [144]:
pieces

['a', 'b', 'guido']

In [145]:
'::'.join(pieces)

'a::b::guido'

In [146]:
'guido' in val

True

In [147]:
val.index(',')

1

In [148]:
val.count(',')

2

In [149]:
val.replace(',', '::')

'a::b::  guido'

In [150]:
import re

In [151]:
text = "foo    bar\t baz  \tqux"

In [152]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [153]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [154]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [155]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [156]:
regex.search(text)

In [157]:
regex.match(text)

In [158]:
pattern2 = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [159]:
regex2 = re.compile(pattern2, flags=re.IGNORECASE)

In [160]:
regex2.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]